app/Controllers/AuthController.php

    public function changePassword()
    {
        $current  = $this->request->getPost('current_password');
        $new      = $this->request->getPost('new_password');
        $confirm  = $this->request->getPost('confirm_password');

        if ($new !== $confirm) {
            return redirect()->back()->with('error', 'A nova senha e a confirmação não coincidem.');
        }

        if (strlen($new) < 6) {
            return redirect()->back()->with('error', 'A nova senha deve ter pelo menos 6 caracteres.');
        }

        $model = new UserModel();
        $user  = $model->find(session()->get('user_id'));

        if (!password_verify($current, $user['password'])) {
            return redirect()->back()->with('error', 'Senha atual incorreta.');
        }

        $model->update($user['id'], ['password' => password_hash($new, PASSWORD_DEFAULT)]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
UPDATE `users` SET `password` = '$2y$12$Y2trhpJm0p4foY2PhqYlcufhfYM08aqfClItQXxNf3eh24PvNUJrO', `updated_at` = '2026-03-01 09:45:55'
WHERE `users`.`id` IN ('5')