app/Models/OrderModel.php

    public function getOrdersByUser(int $userId)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = 1
ORDER BY `created_at` DESC

    public function getOrderWithItems(int $orderId, int $userId)
    {
        $order = $this->where('id', $orderId)->where('user_id', $userId)->first();
        if (!$order) return null;

        $db = \Config\Database::connect();
        $order['items'] = $db->table('order_items oi')
            ->select('oi.*, p.name as product_name, p.category')
            ->join('products p', 'p.id = oi.product_id')
            ->where('oi.order_id', $orderId)
            ->get()->getResultArray();
---
SELECT *
FROM `orders`
WHERE `id` = 1
AND `user_id` = 1
 LIMIT 1
SELECT `oi`.*, `p`.`name` as `product_name`, `p`.`category`
FROM `order_items` `oi`
JOIN `products` `p` ON `p`.`id` = `oi`.`product_id`
WHERE `oi`.`order_id` = 1