app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `active` = 1
AND `stock` > 0
ORDER BY `category` ASC, `name` ASC
---
    public function getByCategory()
    {
        return $this->where('active', 1)
                    ->where('stock >', 0)
                    ->orderBy('category', 'ASC')
                    ->orderBy('name', 'ASC')
                    ->findAll();