app/Models/UserModel.php

    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->where('active', 1)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'davi@gmail.com'
AND `active` = 1
 LIMIT 1